#Область ПрограммныйИнтерфейс
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	ТочкаВыдачи = зс_сдэк_ПереопределяемыйСервер.ПолучитьТочкуВыдачиПоПунктуВыдачиЛогистическогоОператора(Ссылка);
	
	Если ЗначениеЗаполнено(ТочкаВыдачи) Тогда
		
		УдаляемаяТочкаВыдачи = ТочкаВыдачи.ПолучитьОбъект();
		УдаляемаяТочкаВыдачи.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти