////////////////////////////////////////////////////////////////////////////////
// зс_сдэк_ПереопределяемыйСервер: процедуры и функции, переопределяемые для целевой конфигурации
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ПриДобавленииПунктаВыдачиПереопределяемая(ЛогистическийОператор, ПунктВыдачи) Экспорт
	
	Если ЛогистическийОператор = "СДЭК" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииПунктаВыдачиПереопределяемая(ЛогистическийОператор, ПунктВыдачи) Экспорт
	
	Если ЛогистическийОператор = "СДЭК" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПометкеНаУдалениеПунктаВыдачиПереопределяемая(ЛогистическийОператор, ПунктВыдачи) Экспорт
	
	Если ЛогистическийОператор = "СДЭК" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТочкуВыдачиПоПунктуВыдачиЛогистическогоОператора(ПунктВыдачи) Экспорт
	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти