#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.зс_сдэк_АдресСервераИнтеграцииДляИнтернетМагазинов) Тогда
		
		НаборКонстант.зс_сдэк_АдресСервераИнтеграцииДляИнтернетМагазинов = "integration.cdek.ru";
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.зс_сдэк_АдресСервераИнтеграцииОбщий) Тогда
		
		НаборКонстант.зс_сдэк_АдресСервераИнтеграцииОбщий = "api.cdek.ru";
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти